
import { PrismaClient } from '@prisma/client';

const prisma = new PrismaClient();

const rawData = [
    // 2. ประเภทแหล่งเงิน
    { code: '1', name: 'งบประมาณแผ่นดิน', level: 0 },
    { code: '2', name: 'งบประมาณเงินรายได้', level: 0 },
    { code: '3', name: 'งบกลาง (งบประมาณแผ่นดิน)', level: 0 },
    { code: '4', name: 'เงินสะสม (งบประมาณเงินรายได้)', level: 0 },
    { code: '5', name: 'เงินกันเหลื่อมปี(งบประมาณแผ่นดิน)', level: 0 },
    { code: '6', name: 'เงินกันเหลื่อมปี(งบประมาณเงินรายได้)', level: 0 },
    
    // 3. โครงสร้างแผนงาน/งาน-โครงการ/กิจกรรม
    { code: '09', name: 'ด้านการพัฒนาประชากร', level: 0 }, 
        { code: '09007', name: 'ก. แผนงานจัดการศึกษาอุดมศึกษา', level: 1 }, 
            { code: '0101', name: '1. งานสนับสนุนการจัดการศึกษา', level: 2 },
                { code: '010110', name: '1.1 กิจกรรมบริหารทั่วไป', level: 3 },
                { code: '010111', name: '1.2 กิจกรรมทะเบียนนักศึกษาและประมวลผล', level: 3 },
                { code: '010112', name: '1.3 กิจกรรมบริการห้องสมุดและเทคโนโลยีทางการศึกษา', level: 3 },
                { code: '010113', name: '1.4 กิจกรรมบริหารคอมพิวเตอร์ทางวิชาการ', level: 3 },
                { code: '010114', name: '1.5 กิจกรรมบริหารวิชาการ (รวมงานบริการทุนการศึกษา)', level: 3 },
                { code: '010115', name: '1.6 กิจกรรมพัฒนาคุณภาพนักศึกษา', level: 3 },
                { code: '010116', name: '1.7 กิจกรรมพัฒนาบุคลากรทางวิชาการ', level: 3 },
                { code: '010117', name: '1.8 กิจกรรมผลิตและพัฒนาสื่อการศึกษา', level: 3 },
                { code: '010118', name: '1.9 กิจกรรมพัฒนาหลักสูตรและการเรียนการสอน', level: 3 },
                { code: '010119', name: '1.10 กิจกรรมส่งเสริมการผลิตตำรา', level: 3 },
            { 'code': '0102', 'name': '2. งานจัดการศึกษาด้านวิทยาศาสตร์และเทคโนโลยี', level: 2 },
                { code: '20', name: '2.1 กิจกรรมสาขาครุศาสตร์อุตสาหกรรม', level: 3 },
                { code: '21', name: '2.2 กิจกรรมสาขาวิทยาศาสตร์', level: 3 },
                { code: '22', name: '2.3 กิจกรรมสาขาวิศวกรรมศาสตร์', level: 3 },
                { code: '23', name: '2.4 กิจกรรมสาขาสถาปัตยกรรมศาสตร์', level: 3 },
                { code: '24', name: '2.5 กิจกรรมสาขาเทคโนโลยีการเกษตร', level: 3 },
                { code: '25', name: '2.6 กิจกรรมสาขาเทคโนโลยีสารสนเทศ', level: 3 },
                { code: '26', name: '2.7 กิจกรรมสาขาวิชาพื้นฐานและวิชาเลือก/โท', level: 3 },
                { code: '27', name: '2.8 กิจกรรมสาขาอุตสาหกรรมเกษตร', level: 3 },
                { code: '28', name: '2.9 กิจกรรมสาขาวิชาพื้นฐานทั่วไป', level: 3 },
                { code: '29', name: '2.10 กิจกรรมสาขาบริหารและการจัดการ', level: 3 },
                { code: '30', name: '2.11 กิจกรรมสาขาวิทยาศาสตร์สุขภาพ', level: 3 },
                { code: '31', name: '2.12 กิจกรรมสาขานวัตกรรมทางการศึกษา', level: 3 },
                { code: '32', name: '2.13 กิจกรรมอุตสาหกรรมการบิน', level: 3 },
                { code: '33', name: '2.14 กิจกรรมสาขาศิลปศาสตร์', level: 3 },
        { code: '09010', name: 'ข. แผนงานบริการวิชาการแก่สังคม', level: 1 }, 
            { code: '0201', name: '1. งานบริการวิชาการแก่ชุมชน', level: 2 }, 
        { code: '09011', name: 'ค. แผนงานศาสนา ศิลปะ และวัฒนธรรม', level: 1 },
            { code: '0301', name: '1. งานทำนุบำรุงศิลปวัฒนธรรม', level: 2 },
        { code: '06006', name: 'ง. แผนงานยุทธศาสตร์', level: 1 },
            { code: '0601', name: '1. งานพัฒนาและผลิตกำลังคนของประเทศ เพื่อรองรับนโยบาย Thailand 4.0', level: 2 },
            { code: '0602', name: '2. งานสร้างกำลังคนที่มีสมรรถนะสูง สำหรับอุตสาหกรรม New Growth Engine ตามนโยบาย Thailand 4.0', level: 2 },
            { code: '0603', name: '3. งานพัฒนากําลังคนด้านวิศวกรรมศาสตร์เทคโนโลยีและนวัตกรรม', level: 2 },
            { code: '0604', name: '4. งานวิจัยและพัฒนานวัตกรรม', level: 2 },
            { code: '0605', name: '5. งานพัฒนาทักษะกําลังคนของประเทศ', level: 2 },
            { code: '0606', name: '6. งาน 1 อําเภอ 1 แปลงเกษตรอัจฉริยะ', level: 2 },
            { code: '0607', name: '7. งานพัฒนาความเป็นเลิศของสถาบันอุดมศึกษาและพัฒนากําลังคนขั้นสูง', level: 2 },
        { code: '06005', name: 'ข. แผนงานบูรณาการ', level: 1 },
            { code: '0501', name: '1.งานส่งเสริม และพัฒนาเทคโนโลยี นวัตกรรม', level: 2 },
            { code: '0502', name: '2. งานพัฒนาพื้นที่ระเบียงเศรษฐกิจภาคตะวันออก', level: 2 },
            { code: '0503', name: '3. งานพัฒนาคุณภาพชีวิต สร้างความสมดุลทางเศรษฐกิจ', level: 2 },
    // 4. กิจกรรม
    { code: '0101', name: '1. กิจกรรมหลัก งานสนับสนุนการจัดการศึกษา', level: 0 },
        { code: '10', name: '1.1 กิจกรรมรอง บริหารทั่วไป', level: 1 },
            { code: '170', name: '1.1.1 กิจกรรมย่อย งานบริหารทั่วไป (รวมบริหารจัดการกลาง)', level: 2 },
            { code: '180', name: '1.1.2 กิจกรรมย่อย งานด้านทรัพยากรบุคคลและนิติการ', level: 2 },
            { code: '190', name: '1.1.3 กิจกรรมย่อย งานด้านอาคารสถานที่ บำรุงรักษาและยานพาหนะ ระบบสาธารณูปโภค', level: 2 },
            { code: '200', name: '1.1.4 กิจกรรมย่อย งานด้านนโยบาย แผนพัฒนา แผนงบประมาณ วิจัยสถาบัน และการประกันคุณภาพการศึกษา', level: 2 },
            { code: '210', name: '1.1.5 กิจกรรมย่อย งานด้านการเงิน บัญชี งบประมาณ และพัสดุ', level: 2 },
            { code: '220', name: '1.1.6 กิจกรรมย่อย งานด้านวิเทศสัมพันธ์', level: 2 },
            { code: '230', name: '1.1.7 กิจกรรมย่อย งานด้านโรงพิมพ์ สารนิเทศ และประชาสัมพันธ์', level: 2 },
        { code: '11', name: '1.2 กิจกรรมรอง ทะเบียนนักศึกษาและประมวลผล', level: 1 },
            { code: '114', name: '1.2.1 กิจกรรมย่อย งานด้านรับเข้าศึกษานักศึกษาและทะเบียนประวัติ', level: 2 },
            { code: '115', name: '1.2.2 กิจกรรมย่อย งานด้านทะเบียนการศึกษา', level: 2 },
            { code: '116', name: '1.2.3 กิจกรรมย่อย งานด้านบริหารการเรียนการสอน', level: 2 },
            { code: '117', name: '1.2.4 กิจกรรมย่อย งานด้านประมวลผลการศึกษา', level: 2 },
            { code: '118', name: '1.2.5 กิจกรรมย่อย งานด้านตรวจสอบและรับรองผลการศึกษา', level: 2 },
        { code: '12', name: '1.3 กิจกรรมรอง บริการห้องสมุดและเทคโนโลยีทางการศึกษา', level: 1 },
            { code: '123', name: '1.3.1 กิจกรรมย่อย งานด้านเทคนิค', level: 2 },
            { code: '124', name: '1.3.2 กิจกรรมย่อย งานด้านบริการสารนิเทศ', level: 2 },
            { code: '125', name: '1.3.2 กิจกรรมย่อย งานเทคโนโลยีสารสนเทศ', level: 2 },
        { code: '13', name: '1.4 กิจกรรมรอง บริการคอมพิวเตอร์ทางวิชาการ', level: 1 },
            { code: '133', name: '1.4.1 กิจกรรมย่อย งานด้านควบคุมเครื่องและระบบเครือข่าย', level: 2 },
            { code: '134', name: '1.4.2 กิจกรรมย่อย งานด้านบริการคอมพิวเตอร', level: 2 },
        
        { code: '14', name: '1.5 กิจกรรมรอง บริหารวิชาการ', level: 1 },
            { code: '142', name: '1.5.1 กิจกรรมย่อย งานวิชาการและการมาตรฐานการศึกษา', level: 2 },
            { code: '143', name: '1.5.2 กิจกรรมย่อย งานบริหารจัดการศึกษาทั่วไป', level: 2 },
            { code: '144', name: '1.5.3 กิจกรรมย่อย งานส่งเสริมและพัฒนาการศึกษา', level: 2 },
            { code: '145', name: '1.5.4 กิจกรรมย่อย งานบริการทุนทางการศึกษา (ระดับปริญญาตรี โท-เอก)', level: 2 },
        { code: '15', name: '1.6 กิจกรรมรอง พัฒนาคุณภาพนักศึกษา', level: 1 },
            { code: '151', name: '1.6.1 กิจกรรมย่อย งานด้านกิจกรรมนักศึกษา', level: 2 },
            { code: '152', name: '1.6.2 กิจกรรมย่อย งานด้านบริการนักศึกษา', level: 2 },
        { code: '16', name: '1.7 กิจกรรมรอง พัฒนาบุคลากรทางวิชาการ', level: 1 },
            { code: '161', name: '1.7.1 กิจกรรมย่อย งานฝึกอบรม/สัมมนา/ศึกษาดูงาน', level: 2 },
            { code: '162', name: '1.7.2 กิจกรรมย่อย การศึกษาต่อ', level: 2 },
            { code: '163', name: '1.7.3 กิจกรรมย่อย การส่งเสริม/สนับสนุนการพัฒนาวิชาการ', level: 2 },
        { code: '17', name: '1.8 กิจกรรมรอง ผลิตและพัฒนาสื่อการศึกษา', level: 1 },
            { code: '171', name: '1.8.1 กิจกรรมย่อย อุปกรณ์การสอน และพัฒนาต้นแบบสื่อการสอน', level: 2 },
            { code: '172', name: '1.8.2 กิจกรรมย่อย บริการเครื่องมือเทคโนโลยีทางการศึกษา (รวมบริการด้านโสตทัศนศึกษา)', level: 2 },
        { code: '18', name: '1.9 กิจกรรมรอง พัฒนาหลักสูตรและการเรียนการสอน', level: 1 },
            { code: '181', name: '1.9.1 กิจกรรมย่อย การปรับปรุงและพัฒนาหลักสูตร', level: 2 },
            { code: '182', name: '1.9.2 กิจกรรมย่อย การประเมินผลโครงสร้างหลักสูตร', level: 2 },
            { code: '183', name: '1.9.3 กิจกรรมย่อย การบริหารและสนับสนุนวิชาการ', level: 2 },
        { code: '19', name: '1.10 กิจกรรมรอง ส่งเสริมการผลิตตำรา', level: 1 }, 
            { code: '191', name: '1.10.1 กิจกรรมย่อย ผลิตและพัฒนาตำราในสาขาต่างๆ', level: 2 },
    { code: '0102', name: '2. กิจกรรมหลัก จัดการศึกษาด้านวิทยาศาสตร์และเทคโนโลยี', level: 0 },
        { code: '20', name: '2.1 กิจกรรมรอง สาขาครุศาสตร์อุตสาหกรรม', level: 1 }, 
        { code: '21', name: '2.2 กิจกรรมรอง สาขาวิทยาศาสตร์', level: 1 }, 
        { code: '22', name: '2.3 กิจกรรมรอง สาขาวิศวกรรมศาสตร์', level: 1 }, 
        { code: '23', name: '2.4 กิจกรรมรอง สาขาสถาปัตยกรรมศาสตร์', level: 1 }, 
        { code: '24', name: '2.5 กิจกรรมรอง สาขาเทคโนโลยีการเกษตร', level: 1 }, 
        { code: '25', name: '2.6 กิจกรรมรอง สาขาเทคโนโลยีสารสนเทศ', level: 1 }, 
        { code: '26', name: '2.7 กิจกรรมรอง สาขาวิชาพื้นฐานและวิชาเลือก/โท', level: 1 }, 
        { code: '27', name: '2.8 กิจกรรมรอง สาขาอุตสาหกรรมเกษตร', level: 1 }, 
        { code: '28', name: '2.9 กิจกรรมรอง สาขาวิชาพื้นฐานทั่วไป', level: 1 }, 
        { code: '29', name: '2.10 กิจกรรมรอง สาขาบริหารและการจัดการ', level: 1 }, 
        { code: '30', name: '2.11 กิจกรรมรอง สาขาวิทยาศาสตร์สุขภาพ', level: 1 }, 
        { code: '31', name: '2.12 กิจกรรมรอง สาขานวัตกรรมทางการศึกษา', level: 1 }, 
        { code: '32', name: '2.13 กิจกรรมรอง อุตสาหกรรมการบิน', level: 1 }, 
        { code: '33', name: '2.14 กิจกรรมรอง สาขาศิลปศาสตร์', level: 1 }, 
        { code: '34', name: '2.15 กิจกรรมรอง สาขาพยาบาลศาสตร์', level: 1 },
        //ปริญญา
            { code: '211', name: 'กิจกรรมย่อย ระดับปริญญาตร', level: 1 },
            { code: '212', name: 'กิจกรรมย่อย ระดับปริญญาโท-เอก', level: 1 },
            { code: '213', name: 'กิจกรรมย่อย สอนบริการวิชาพื้นฐานและวิชาเลือก/โท', level: 1 },
    { code: '0201', name: '5. กิจกรรมหลัก งานบริการวิชาการแก่ชุมชน', level: 0 },
        { code: '51', name: '5.1 กิจกรรมรองจัดฝึกอบรมทางวิชาการ', level: 1 }, 
        { code: '52', name: '5.2 กิจกรรมรองจัดทําวารสารทางวิชาการ', level: 1 }, 
        { code: '53', name: '5.3 กิจกรรมรองจัดแสดงนิทรรศการ', level: 1 }, 
        { code: '54', name: '5.4 กิจกรรมรอง บริการวิชาการรูปแบบต่าง ๆ ', level: 1 }, 
    { code: '0201', name: '5. กิจกรรมหลัก งานบริการวิชาการแก่ชุมชน', level: 0 },
        { code: '51', name: '5.1 กิจกรรมรองจัดฝึกอบรมทางวิชาการ', level: 1 },
        { code: '52', name: '5.2 กิจกรรมรองจัดทําวารสารทางวิชาการ', level: 1 },
        { code: '53', name: '5.3 กิจกรรมรองจัดแสดงนิทรรศการ', level: 1 },
        { code: '54', name: '5.4 กิจกรรมรอง บริการวิชาการรูปแบบต่าง ๆ', level: 1 },
    { code: '0301', name: '6. กิจกรรมหลัก งานทำนุบำรุงศิลปวัฒนธรรม', level: 0 },
        { code: '30', name: '6.1 กิจกรรมรอง งานจัดฝึกอบรม/การจัดนิทรรศการ', level: 1 },
        { code: '31', name: '6.2 กิจกรรมรอง การเผยแพร่/ประชาสัมพันธ์', level: 1 },
        { code: '32', name: '6.3 กิจกรรมรอง การดำเนินงานอื่นๆ (ด้านศิลปวัฒนธรรม)', level: 1 },
    { code: '0401', name: '7. กิจกรรมหลัก งานวิจัยพัฒนาและถ่ายทอดเทคโนโลยี', level: 0 },
        { code: '40', name: '7.1 กิจกรรมรอง วิจัยพื้นฐาน', level: 1 },
        { code: '41', name: '7.2 กิจกรรมรอง วิจัยประยุกต์', level: 1 },
        { code: '42', name: '7.3 กิจกรรมรอง วิจัยและพัฒนา และถ่ายทอดเทคโนโลยี', level: 1 },
        { code: '43', name: '7.4 กิจกรรมรอง การวิจัยเพื่อดำเนินการตามนโยบายรัฐบาล (แผนงานบูรณาการวิจัยและนวัตกรรม)', level: 1 },
    { code: '0501', name: '8. กิจกรรมหลัก งานส่งเสริม และพัฒนาเทคโนโลยี นวัตกรรม', level: 0 },
        { code: '50', name: '8.1 กิจกรรมรอง พัฒนาอุตสาหกรรมศักยภาพ', level: 1 },
        { code: '51', name: '8.2 กิจกรรมรอง สร้างรายได้จากการท่องเที่ยวและบริการ', level: 1 },
        { code: '52', name: '8.3 กิจกรรมรอง พัฒนาศักยภาพการผลิตภาคเกษตร', level: 1 },
        { code: '53', name: '8.4 กิจกรรมรอง พัฒนาศักยภาพคนตามช่วงวัย', level: 1 },
        { code: '54', name: '8.5 กิจกรรมรอง ยกระดับคุณภาพการศึกษาและการเรียนรู้ตลอดชีวิต', level: 1 },
        { code: '55', name: '8.6 กิจกรรมรอง เสริมสร้างความเข้มแข็งและยั่งยืนให้กับเศรษฐกิจภายในประเทศ', level: 1 },
    { code: '0502', name: '9. งานพัฒนาพื้นที่ระเบียงเศรษฐกิจภาคตะวันออก', level: 0 },
        { code: '56', name: '9.1 พัฒนาพื้นที่ระเบียงเศรษฐกิจภาคตะวันออก', level: 1 },
    { code: '0503', name: '10. งานพัฒนาคุณภาพชีวิต สร้างความสมดุลทางเศรษฐกิจ', level: 0 },
        { code: '57', name: '10.1 พัฒนาคุณภาพชีวิต สร้างความสมดุลทางเศรษฐกิจ', level: 1 },
//หน้า 16

];

async function main() {
  console.log('Start seeding StructureCode...');

  const CATEGORY_NAME = 'EXPENSE_F5';

  await prisma.expenseItem.deleteMany({
    where: {
      structure: {
        category: CATEGORY_NAME
      }
    }
  });

  await prisma.structureCode.deleteMany({
    where: {
      category: CATEGORY_NAME
    }
  });

  const lastParents: Record<number, number> = {};

  for (const item of rawData) {
    let parentId = null;

    if (item.level > 0) {
      parentId = lastParents[item.level - 1];
      if (!parentId) {
        console.warn(`Warning: Orphan node found for ${item.name} (Level ${item.level}). Previous parent missing.`);
      }
    }

    const created = await prisma.structureCode.create({
      data: {
        code: item.code,
        name: item.name,
        level: item.level,
        is_header: !item.is_leaf,
        parent_id: parentId,
        // *** ใส่ Category เข้าไปตอนสร้าง ***
        category: CATEGORY_NAME,
      },
    });

    lastParents[item.level] = created.id;
    // Clear deeper levels to prevent jumping (e.g., L3 shouldn't be parent of next L3)
    for (let l = item.level + 1; l <= 10; l++) {
      delete lastParents[l];
    }
  }

  console.log(`Seeding finished. Inserted ${rawData.length} rows.`);
}

main()
  .catch((e) => {
    console.error(e);
    process.exit(1);
  })
  .finally(async () => {
    await prisma.$disconnect();
  });